[
  {
    "id": 1,
    "name": "Ağbaba Mahalı",
    "slug": "agbaba",
    "image": "https://western-azerbaijan.az/wp-content/uploads/2023/10/%D0%A0%D0%B5%D0%B3%D0%B8%D0%BE%D0%BD11-min.png",
    "description": "Ağbaba mahalı — Qərbi Azərbaycanın (indiki Ermənistan) tarixi mahallarından biri. Bu mahal özünün zəngin təbiəti, sərt iqlimi və qəhrəman insanları ilə tanınır.",
    "history": "Ağbaba mahalı qədim türk yurdlarından biridir. Tarixən bu ərazidə oğuz türkləri məskunlaşmışdır. 1918-1920-ci illərdə erməni daşnaklarının hücumlarına məruz qalmış, lakin yerli əhali öz torpaqlarını qəhrəmancasına müdafiə etmişdir. Sovet dövründə Amasiya rayonu kimi təşkil olunmuşdur.",
    "geography": "Ağbaba mahalı dağlıq ərazidə yerləşir. Arpaçay bu mahalın ərazisindən axır. Qışı sərt və uzun, yayı isə sərin keçir. Alp çəmənlikləri və buzlaqları ilə məşhurdur.",
    "culture": "Ağbaba aşıq mühiti ilə seçilir. Aşıq Ələsgər məktəbinin təsiri burada güclü olmuşdur. Xalçaçılıq və keçəçilik sənəti yüksək inkişaf etmişdir.",
    "villages": ["Amasiya", "Güllübulaq", "Oxçuoğlu", "Çaxmax", "Qaraçanta", "Balıqlı", "İbiş", "Qonçalı"],
    "stats": {
      "area": "1200 km²",
      "population": "Tarixən 30,000+",
      "elevation": "2000-3000m",
      "villagesCount": 45
    }
  },
  {
    "id": 2,
    "name": "Şörəyel Mahalı",
    "slug": "shoreyel",
    "image": "https://western-azerbaijan.az/wp-content/uploads/2023/10/%D0%A0%D0%B5%D0%B3%D0%B8%D0%BE%D0%BD12-min.png",
    "description": "Şörəyel mahalı — Qərbi Azərbaycanın ən qədim və məhsuldar torpaqlarından biri. Tarixi abidələri və strateji mövqeyi ilə seçilir.",
    "history": "Şörəyel mahalı Qars vilayəti ilə həmsərhəd olub, tarixən mühüm ticarət yollarının kəsişməsində yerləşmişdir. XIX əsrin əvvəllərində Rusiya imperiyası tərəfindən işğal edilmişdir. 1988-ci ilə qədər azərbaycanlıların sıx yaşadığı bölgələrdən biri olmuşdur.",
    "geography": "Şörəyel düzənlik və dağətəyi əraziləri əhatə edir. Torpaqları çox bərəkətlidir, taxılçılıq və heyvandarlıq üçün əlverişlidir. İqlimi kontinentaldır.",
    "culture": "Bölgədə qədim memarlıq abidələri, məscidlər və karvansaraylar mövcud olmuşdur. Folklor nümunələri və bayatıları ilə zəngindir.",
    "villages": ["Ağin", "Düzkənd", "Mollaqışlaq", "Qızılqula", "Bayan", "Kərimkənd"],
    "stats": {
      "area": "950 km²",
      "population": "Tarixən 25,000+",
      "elevation": "1500-2000m",
      "villagesCount": 38
    }
  }
]
